&НаКлиенте
Процедура CNYПриИзменении(Элемент)
	ПересчитатьЗначениеВалюты("CNY");
КонецПроцедуры

&НаКлиенте
Процедура PLNПриИзменении(Элемент)
	ПересчитатьЗначениеВалюты("PLN");
КонецПроцедуры

&НаКлиенте
Процедура RUBПриИзменении(Элемент)
	ПересчитатьЗначениеВалюты("RUB");
КонецПроцедуры

&НаКлиенте
Процедура EURПриИзменении(Элемент)
	ПересчитатьЗначениеВалюты("EUR");
КонецПроцедуры

&НаКлиенте
Процедура USDПриИзменении(Элемент)
	ПересчитатьЗначениеВалюты("USD");
КонецПроцедуры

&НаКлиенте
Процедура BYNПриИзменении(Элемент)
	ПересчитатьЗначениеВалюты("BYN");
КонецПроцедуры
Процедура ПересчитатьЗначениеВалюты(ПередаваемаяВалюта)
	КурсыВалют = ПолучитьКурсВалюты();

	ЗначениеИсточника = Элементы[ПередаваемаяВалюта].Значение;

	Если ПередаваемаяВалюта = "BYN" Тогда
		СуммаBYN = ЗначениеИсточника;
	Иначе
		СуммаBYN = ЗначениеИсточника * КурсыВалют[ПередаваемаяВалюта];
	КонецЕсли;

	Элементы["BYN"].Значение = Окр(СуммаBYN, 2);
	Элементы["USD"].Значение = Окр(СуммаBYN / КурсыВалют["USD"], 2);
	Элементы["EUR"].Значение = Окр(СуммаBYN / КурсыВалют["EUR"], 2);
	Элементы["RUB"].Значение = Окр(СуммаBYN / КурсыВалют["RUB"], 2);
	Элементы["PLN"].Значение = Окр(СуммаBYN / КурсыВалют["PLN"], 2);
	Элементы["CNY"].Значение = Окр(СуммаBYN / КурсыВалют["CNY"], 2);

КонецПроцедуры

&НаСервере
Функция ПолучитьКурсВалюты()

	Курсы = Новый Соответствие;
	ТекущаяДата = ТекущаяДатаСеанса();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КурсыВалют.Валюта,
	|	КурсыВалют.Значение
	|ИЗ
	|	РегистрСведений.КурсыВалют КАК КурсыВалют
	|ГДЕ
	|	КурсыВалют.Дата = &Дата";

	Запрос.УстановитьПараметр("Дата", ТекущаяДата);
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		Курсы[Выборка.Валюта] = Выборка.Валюта;
	КонецЦикла;
	
	Возврат Курсы;

КонецФункции