&НаКлиенте
Процедура CNYПриИзменении(Элемент)
	ПересчитатьЗначениеВалюты("CNY");
КонецПроцедуры

&НаКлиенте
Процедура PLNПриИзменении(Элемент)
	ПересчитатьЗначениеВалюты("PLN");
КонецПроцедуры

&НаКлиенте
Процедура RUBПриИзменении(Элемент)
	ПересчитатьЗначениеВалюты("RUB");
КонецПроцедуры

&НаКлиенте
Процедура EURПриИзменении(Элемент)
	ПересчитатьЗначениеВалюты("EUR");
КонецПроцедуры

&НаКлиенте
Процедура USDПриИзменении(Элемент)
	ПересчитатьЗначениеВалюты("USD");
КонецПроцедуры

&НаКлиенте
Процедура BYNПриИзменении(Элемент)
	ПересчитатьЗначениеВалюты("BYN");
КонецПроцедуры
&НаКлиенте
Процедура ПересчитатьЗначениеВалюты(ПередаваемаяВалюта)

	ЗначениеИсточника = ЭтотОбъект[ПередаваемаяВалюта];

	Если ПередаваемаяВалюта = "BYN" Тогда
		СуммаBYN = ЗначениеИсточника;
	Иначе
		СуммаBYN = ЗначениеИсточника * ПолучитьКурсВалюты(ПередаваемаяВалюта);
	КонецЕсли;

	ЭтотОбъект["BYN"]= СуммаBYN;
	ЭтотОбъект["USD"]= СуммаBYN / ПолучитьКурсВалюты("USD");
	ЭтотОбъект["EUR"]= СуммаBYN / ПолучитьКурсВалюты("EUR");
	ЭтотОбъект["RUB"]= СуммаBYN / ПолучитьКурсВалюты("RUB");
	ЭтотОбъект["PLN"]= СуммаBYN / ПолучитьКурсВалюты("PLN");
	ЭтотОбъект["CNY"]= СуммаBYN / ПолучитьКурсВалюты("CNY");

КонецПроцедуры

&НаСервере
Функция ПолучитьКурсВалюты(Валюта)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КурсыВалют.Значение
	|ИЗ
	|	РегистрСведений.КурсыВалют КАК КурсыВалют
	|ГДЕ
	|	КурсыВалют.ВалютаАббревиатура = &ВалютаАббревиатура";

	Запрос.УстановитьПараметр("ВалютаАббревиатура", Валюта);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Значение;
	КонецЦикла;

КонецФункции