Процедура РгЗадание() Экспорт
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
	Соединение = Новый HTTPСоединение("api.nbrb.by", , , , , 30, ЗащищенноеСоединение);

	Запрос = Новый HTTPЗапрос("/exrates/rates?periodicity=0");

	Ответ = Соединение.ВызватьHTTPМетод("GET", Запрос);

	Если Ответ.КодСостояния = 200 Тогда
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТелоОтвета);

		Данные = ПрочитатьJSON(ЧтениеJSON, Истина);

		Для Каждого Значение Из Данные Цикл
			Запись = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
			Запись.ВалютаПолноеНазвание = Значение["Cur_Name"];
			Запись.Значение = Значение["Cur_OfficialRate"];
			Запись.ВалютаАббревиатура = Значение["Cur_Abbreviation"];
			Запись.Период = ТекущаяДатаСеанса();
			Запись.Записать();
		КонецЦикла;
	Иначе

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка вызова запроса";
		Сообщение.Сообщить();

	КонецЕсли;
КонецПроцедуры